---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridlineAxisTooClose
source: html/594cf719-48f6-7c62-2178-da9e777664c0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridFailures.GridlineAxisTooClose Property

Axis of gridlines should not change order or be closer than [Value] to each other.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlineAxisTooClose { get; }
```